lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  BluefruitCompatManager()
      : started_(false),
        last_connected_(false),
        last_connection_role_(BleConnectionRole::kNone),
        last_connection_edge_ms_(0UL),
        next_adv_due_us_(0U),
        adv_started_ms_(0UL),
        scan_rsp_name_added_(false),
        characteristic_count_(0U),
        client_characteristic_count_(0U),
        pending_connect_valid_(false),
        pending_connect_random_(0U),
        central_sync_procedure_depth_(0U),
        central_data_length_request_pending_(false),
        central_mtu_request_pending_(false),
        deferred_connection_phy_request_pending_(false),
        deferred_connection_data_length_request_pending_(false),
        deferred_connection_mtu_request_pending_(false),
        deferred_connection_requested_phy_(BLE_GAP_PHY_AUTO),
        deferred_connection_requested_mtu_(kDefaultAttMtu),
        deferred_connection_phy_next_ms_(0UL),
        deferred_connection_data_length_next_ms_(0UL),
        deferred_connection_mtu_next_ms_(0UL),
        deferred_connection_phy_attempts_(0U),
        deferred_connection_data_length_attempts_(0U),
        deferred_connection_mtu_attempts_(0U),
        central_connect_callback_pending_(false),
        central_connect_callback_not_before_ms_(0UL),
        central_link_config_not_before_ms_(0UL),
        last_connect_attempt_ms_(0UL),
        rssi_monitor_enabled_(false),
        rssi_monitor_threshold_(0xFFU),
        last_reported_rssi_dbm_(0),
        last_reported_rssi_valid_(false),
        scan_report_data_{0},
        scan_report_len_(0U) {
    memset(characteristics_, 0, sizeof(characteristics_));
    memset(client_characteristics_, 0, sizeof(client_characteristics_));
    memset(&scan_report_, 0, sizeof(scan_report_));
    memset(pending_connect_address_, 0, sizeof(pending_connect_address_));
  }

  bool begin(uint8_t prph_count, uint8_t central_count) {
    (void)prph_count;
    (void)central_count;
    if (started_) {
      return true;
    }

    if (!radio_.begin()) {
      return false;
    }
    radio_.loadAddressFromFicr();
    radio_.setAdvertisingPduType(xiao_nrf54l15::BleAdvPduType::kAdvInd);
    radio_.setAdvertisingChannelSelectionAlgorithm2(false);
    radio_.clearCustomGatt();
    radio_.setGattDeviceName(Bluefruit.device_name_);
    radio_.setGattAppearance(Bluefruit.appearance_);
    radio_.setPreferredConnectionParameters(Bluefruit.Periph.conn_interval_min_,
                                            Bluefruit.Periph.conn_interval_max_,
                                            Bluefruit.Periph.conn_latency_,
                                            Bluefruit.Periph.conn_supervision_timeout_);
    // Bluefruit defaults to a 23-byte ATT MTU and 27-byte LL data length
    // unless the sketch explicitly chooses a wider bandwidth profile.
    radio_.setPeripheralPreferredAttMtu(Bluefruit.periph_requested_mtu_);
    radio_.setPeripheralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.periph_requested_mtu_));
    radio_.setCentralPreferredAttMtu(Bluefruit.central_requested_mtu_);
    radio_.setCentralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.central_requested_mtu_));
    radio_.setCustomGattWriteCallback(&BluefruitCompatManager::gattWriteThunk, this);

    if (Bluefruit.auto_conn_led_) {
      pinMode(LED_BUILTIN, OUTPUT);
      digitalWrite(LED_BUILTIN, kLedOffState);
    }

    started_ = true;
    last_connected_ = radio_.isConnected();
    last_connection_role_ = radio_.connectionRole();
    return true;
  }

  BleRadio& radio() { return radio_; }
  const BleRadio& radio() const { return radio_; }

  void beginCentralSyncProcedure() {
    if (central_sync_procedure_depth_ < 0xFFU) {
      ++central_sync_procedure_depth_;
    }
  }

  void endCentralSyncProcedure() {
    if (central_sync_procedure_depth_ > 0U) {
      --central_sync_procedure_depth_;
    }
  }

  bool centralSyncProcedureActive() const { return central_sync_procedure_depth_ != 0U; }

  bool stopScanner() {
    const bool wasActive = Bluefruit.Scanner.running_ ||
                           Bluefruit.Scanner.paused_ ||
                           pending_connect_valid_;
    Bluefruit.Scanner.running_ = false;
    Bluefruit.Scanner.paused_ = false;
    Bluefruit.Scanner.timeout_s_ = 0U;
    pending_connect_valid_ = false;
    return wasActive;
  }

  bool deferConnectionPhyRequest(uint8_t phy) {
    if (!radio_.isConnected()) {
      return false;
    }
    const uint8_t normalized = normalizeBluefruitPhy(phy);
    if (normalized == BLE_GAP_PHY_AUTO) {
      return false;
    }
    deferred_connection_requested_phy_ = normalized;
    deferred_connection_phy_request_pending_ = true;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_phy_next_ms_ =
        millis() + kDeferredPhyRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionDataLengthUpdate() {
    if (!radio_.isConnected()) {
      return false;
    }
    deferred_connection_data_length_request_pending_ = true;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_data_length_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionMtuExchange(uint16_t mtu) {
    if (!radio_.isConnected()) {
      return false;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    }
    deferred_connection_requested_mtu_ = mtu;
    deferred_connection_mtu_request_pending_ = true;
    deferred_connection_mtu_attempts_ = 0U;
    deferred_connection_mtu_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

