lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  void processCentralBackgroundEvents(uint8_t maxEvents) {
    maybeApplyCentralLinkConfig();
    for (uint8_t i = 0U; i < maxEvents; ++i) {
      BleConnectionEvent event{};
      if (!radio_.consumeDeferredConnectionEvent(&event)) {
        break;
      }
      handleCentralConnectionEvent(event);
    }
  }

  bool applyAdvertisingPayloads() {
    if (!radio_.setAdvertisingPduType(
            static_cast<xiao_nrf54l15::BleAdvPduType>(Bluefruit.Advertising.adv_type_))) {
      return false;
    }
    if (!radio_.setAdvertisingData(Bluefruit.Advertising.data_, Bluefruit.Advertising.len_)) {
      return false;
    }
    if (!radio_.setScanResponseData(Bluefruit.ScanResponse.data_, Bluefruit.ScanResponse.len_)) {
      return false;
    }
    Bluefruit.Advertising.dirty_ = false;
    Bluefruit.ScanResponse.dirty_ = false;
    return true;
  }

  void maybeAdvertise() {
    ++g_bluefruitMaybeAdvertiseCallCount;
    if (!Bluefruit.Advertising.running_) {
      if (radio_.isBackgroundAdvertisingEnabled()) {
        radio_.stopBackgroundAdvertising();
      }
      return;
    }

    if (Bluefruit.Advertising.stop_timeout_s_ != 0U) {
      const unsigned long elapsedMs = schedulerTimeMs() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.stop_timeout_s_) *
                        1000UL)) {
        Bluefruit.Advertising.running_ = false;
        if (radio_.isBackgroundAdvertisingEnabled()) {
          radio_.stopBackgroundAdvertising();
        }
        if (Bluefruit.Advertising.stop_callback_ != nullptr) {
          invokeBluefruitUserCallback(Bluefruit.Advertising.stop_callback_);
        }
        return;
      }
    }

    if (Bluefruit.Advertising.dirty_ || Bluefruit.ScanResponse.dirty_) {
      if (!applyAdvertisingPayloads()) {
        return;
      }
      if (radio_.isBackgroundAdvertisingEnabled()) {
        radio_.stopBackgroundAdvertising();
      }
    }

    uint16_t intervalUnits = Bluefruit.Advertising.interval_fast_;
    if (Bluefruit.Advertising.fast_timeout_s_ != 0U) {
      const unsigned long elapsedMs = schedulerTimeMs() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.fast_timeout_s_) *
                        1000UL)) {
        intervalUnits = (Bluefruit.Advertising.interval_slow_ != 0U)
                            ? Bluefruit.Advertising.interval_slow_
                            : Bluefruit.Advertising.interval_fast_;
      }
    }
    if (intervalUnits == 0U) {
      intervalUnits = 32U;
    }

    const uint8_t advType = Bluefruit.Advertising.adv_type_;
    if (advType == BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED) {
      if (radio_.isBackgroundAdvertisingEnabled()) {
        return;
      }

      bool backgroundStarted = false;
      {
        const uint32_t intervalUs = static_cast<uint32_t>(intervalUnits) * 625UL;
        if ((intervalUs % 1000UL) == 0UL) {
          const uint32_t intervalMs = intervalUs / 1000UL;
#if defined(NRF54L15_CLEAN_POWER_LOW)
          backgroundStarted = radio_.beginBackgroundAdvertising(
              intervalMs, xiao_nrf54l15::BleAdvertisingChannel::k37, 1200U,
              true, true);
#else
          backgroundStarted =
              radio_.beginBackgroundAdvertising3Channel(intervalMs, 350U, 1200U,
                                                        true);
#endif
        }
      }
      if (backgroundStarted) {
        return;
      }
    }

    const uint64_t nowUs = schedulerTimeUs();
    if (next_adv_due_us_ != 0U && !timeReachedUs(nowUs, next_adv_due_us_)) {
      ++g_bluefruitMaybeAdvertiseNotDueCount;
      return;
    }

    g_bluefruitMaybeAdvertiseIntervalUnitsLast = intervalUnits;
    if (intervalUnits < g_bluefruitMaybeAdvertiseIntervalUnitsMin) {
      g_bluefruitMaybeAdvertiseIntervalUnitsMin = intervalUnits;
    }
    if (intervalUnits > g_bluefruitMaybeAdvertiseIntervalUnitsMax) {
      g_bluefruitMaybeAdvertiseIntervalUnitsMax = intervalUnits;
    }

    if (advType == BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED ||
        advType == BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED) {
      (void)radio_.advertiseInteractEvent(nullptr, 120U);
      ++g_bluefruitMaybeAdvertiseConnectableEventCount;
    } else {
      (void)radio_.advertiseEvent();
      ++g_bluefruitMaybeAdvertiseNonconnEventCount;
    }

    ++g_bluefruitMaybeAdvertiseEventCount;
    if (g_bluefruitMaybeAdvertiseLastEventUs != 0ULL) {
      const uint64_t gapUs64 = nowUs - g_bluefruitMaybeAdvertiseLastEventUs;
      const uint32_t gapUs =
          (gapUs64 > 0xFFFFFFFFULL) ? 0xFFFFFFFFUL : static_cast<uint32_t>(gapUs64);
      g_bluefruitMaybeAdvertiseGapTotalUs += gapUs;
      if (gapUs < g_bluefruitMaybeAdvertiseGapMinUs) {
        g_bluefruitMaybeAdvertiseGapMinUs = gapUs;
      }
      if (gapUs > g_bluefruitMaybeAdvertiseGapMaxUs) {
        g_bluefruitMaybeAdvertiseGapMaxUs = gapUs;
      }
    }
    g_bluefruitMaybeAdvertiseLastEventUs = nowUs;
    next_adv_due_us_ = nowUs + (static_cast<uint32_t>(intervalUnits) * 625UL);
  }

  void maybeDispatchRssiUpdate() {
    if (!rssi_monitor_enabled_ || Bluefruit.rssi_callback_ == nullptr) {
      return;
    }

    int8_t currentRssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&currentRssiDbm)) {
      return;
    }
    if (!last_reported_rssi_valid_) {
      last_reported_rssi_dbm_ = currentRssiDbm;
      last_reported_rssi_valid_ = true;
      return;
    }

    if (currentRssiDbm == last_reported_rssi_dbm_) {
      return;
    }

    const uint8_t threshold = rssi_monitor_threshold_;
    const int deltaDbm = abs(static_cast<int>(currentRssiDbm) -
                             static_cast<int>(last_reported_rssi_dbm_));
    if (threshold != 0xFFU && threshold != 0U &&
        deltaDbm < static_cast<int>(threshold)) {
      return;
    }

    last_reported_rssi_dbm_ = currentRssiDbm;
    invokeBluefruitUserCallback(Bluefruit.rssi_callback_, 0U, currentRssiDbm);
  }

  void handleConnectionEdge(bool connected) {
    if (connected) {
      last_connection_edge_ms_ = millis();
      connection_.handle_ = 0U;
      last_connection_role_ = radio_.connectionRole();
      pending_connect_valid_ = false;
      rssi_monitor_enabled_ = false;
      rssi_monitor_threshold_ = 0xFFU;
      last_reported_rssi_dbm_ = 0;
      last_reported_rssi_valid_ = false;
      if (Bluefruit.auto_conn_led_) {
        digitalWrite(LED_BUILTIN, kLedOnState);
      }
      if (last_connection_role_ == BleConnectionRole::kPeripheral) {
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->_notify_enabled = false;
            characteristics_[i]->_indicate_enabled = false;
          }
        }
        if (Bluefruit.Periph.connect_callback_ != nullptr) {
          invokeBluefruitUserCallback(Bluefruit.Periph.connect_callback_, 0U);
        }
        // Dispatch CCCD=0 callback on each characteristic so sketches
        // reset their notifyenableFlag before the main loop body runs.
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          BLECharacteristic* c = characteristics_[i];
          if (c != nullptr && c->_cccd_wr_cb != nullptr) {
            invokeBluefruitUserCallback(c->_cccd_wr_cb, 0U, c,
                                        static_cast<uint16_t>(0U));
          }
        }
        if (!Bluefruit.Advertising.restart_on_disconnect_) {
          Bluefruit.Advertising.running_ = false;
        }
      } else if (last_connection_role_ == BleConnectionRole::kCentral) {
        Bluefruit.Scanner.paused_ = true;
        central_data_length_request_pending_ = Bluefruit.central_request_data_length_;
        central_mtu_request_pending_ = Bluefruit.central_request_mtu_;
        central_link_config_not_before_ms_ = millis() + 1000UL;
        central_connect_callback_pending_ = false;
        central_connect_callback_not_before_ms_ = 0UL;
        if (Bluefruit.Central.connect_callback_ != nullptr &&
            primeCentralConnectionBeforeUserCallback()) {
          central_connect_callback_pending_ = true;
          central_connect_callback_not_before_ms_ = millis() + 2000UL;
        }
      }
      return;
    }

    last_connection_edge_ms_ = millis();
    radio_.setBackgroundConnectionServiceEnabled(false);
    BleDisconnectDebug debug{};
    uint8_t reason = 0x13U;
    if (radio_.getDisconnectDebug(&debug)) {
      reason = disconnectReasonToHci(debug);
    }
    rssi_monitor_enabled_ = false;
    rssi_monitor_threshold_ = 0xFFU;
    last_reported_rssi_dbm_ = 0;
    last_reported_rssi_valid_ = false;
    deferred_connection_phy_request_pending_ = false;
    deferred_connection_data_length_request_pending_ = false;
    deferred_connection_mtu_request_pending_ = false;
    deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
    deferred_connection_requested_mtu_ = kDefaultAttMtu;
    deferred_connection_phy_next_ms_ = 0UL;
    deferred_connection_data_length_next_ms_ = 0UL;
    deferred_connection_mtu_next_ms_ = 0UL;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_mtu_attempts_ = 0U;
    central_connect_callback_pending_ = false;
    central_connect_callback_not_before_ms_ = 0UL;
    connection_.handle_ = INVALID_CONNECTION_HANDLE;
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      for (uint8_t i = 0U; i < characteristic_count_; ++i) {
        if (characteristics_[i] != nullptr) {
          const bool hadNotify = characteristics_[i]->_notify_enabled;
          const bool hadIndicate = characteristics_[i]->_indicate_enabled;
          characteristics_[i]->_notify_enabled = false;
          characteristics_[i]->_indicate_enabled = false;
          if ((hadNotify || hadIndicate) && characteristics_[i]->_cccd_wr_cb != nullptr) {
            invokeBluefruitUserCallback(characteristics_[i]->_cccd_wr_cb, 0U,
                                        characteristics_[i], 0U);
          }
        }
      }
    }
    if (Bluefruit.auto_conn_led_) {
      digitalWrite(LED_BUILTIN, kLedOffState);
    }
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      if (Bluefruit.Periph.disconnect_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Periph.disconnect_callback_, 0U, reason);
      }
      if (Bluefruit.Advertising.restart_on_disconnect_) {
        Bluefruit.Advertising.running_ = true;
        adv_started_ms_ = schedulerTimeMs();
        next_adv_due_us_ = 0U;
      }
    } else if (last_connection_role_ == BleConnectionRole::kCentral) {
      central_data_length_request_pending_ = false;
      central_mtu_request_pending_ = false;
      central_link_config_not_before_ms_ = 0UL;
      if (Bluefruit.Central.disconnect_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Central.disconnect_callback_, 0U, reason);
      }
      if (Bluefruit.Scanner.restart_on_disconnect_ && Bluefruit.Scanner.running_) {
        Bluefruit.Scanner.paused_ = false;
      }
    }
    last_connection_role_ = BleConnectionRole::kNone;
  }
};

