lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BluefruitCompatManager& manager() {
  static BluefruitCompatManager instance;
  return instance;
}

void serviceBluefruitBeforePollingState() {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().idleService();
  manager().dispatchDeferredUserCallbacks();
}

static constexpr unsigned long kLinkCapacityWaitTimeoutMs = 2000UL;
static constexpr unsigned long kLinkCapacityRetryMs = 100UL;

bool linkValueFitsCurrentConnection(uint16_t valueLen) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const uint16_t requiredAttMtu = static_cast<uint16_t>(3U + valueLen);
  const uint16_t requiredDataLength = static_cast<uint16_t>(7U + valueLen);
  return (manager().radio().currentAttMtu() >= requiredAttMtu) &&
         (manager().radio().currentDataLength() >= requiredDataLength);
}

bool waitForLinkValueCapacity(uint16_t valueLen,
                              unsigned long timeoutMs = kLinkCapacityWaitTimeoutMs) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const uint16_t requiredAttMtu = static_cast<uint16_t>(3U + valueLen);
  const uint16_t requiredDataLength = static_cast<uint16_t>(7U + valueLen);
  if ((requiredAttMtu <= 23U) && (requiredDataLength <= 27U)) {
    return true;
  }

  unsigned long nextDataLengthRequestMs = 0UL;
  unsigned long nextMtuRequestMs = 0UL;
  const unsigned long startMs = millis();
  while (manager().radio().isConnected() &&
         (millis() - startMs) < timeoutMs) {
    if (linkValueFitsCurrentConnection(valueLen)) {
      return true;
    }

    const unsigned long nowMs = millis();
    if (!ScopedBluefruitUserCallback::active()) {
      if ((manager().radio().currentDataLength() < requiredDataLength) &&
          static_cast<long>(nowMs - nextDataLengthRequestMs) >= 0) {
        (void)manager().radio().requestDataLengthUpdate();
        nextDataLengthRequestMs = nowMs + kLinkCapacityRetryMs;
      }
      if ((manager().radio().currentAttMtu() < requiredAttMtu) &&
          static_cast<long>(nowMs - nextMtuRequestMs) >= 0) {
        const uint16_t requestedMtu = min<uint16_t>(247U, requiredAttMtu);
        (void)manager().radio().requestAttMtuExchange(requestedMtu);
        nextMtuRequestMs = nowMs + kLinkCapacityRetryMs;
      }
    }

    manager().idleService();
    yield();
  }

  return linkValueFitsCurrentConnection(valueLen);
}

class ScopedCentralSyncProcedure {
 public:
  ScopedCentralSyncProcedure() { manager().beginCentralSyncProcedure(); }
  ~ScopedCentralSyncProcedure() { manager().endCentralSyncProcedure(); }
};

BLEService* BLEService::lastService = nullptr;
BLEClientService* BLEClientService::lastService = nullptr;
AdafruitBluefruit Bluefruit;
const uint8_t BLEUART_UUID_SERVICE[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x01U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_RXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x02U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_TXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x03U, 0x00U, 0x40U, 0x6EU};

enum class AttWaitOutcome : uint8_t {
  kResponse = 0,
  kError = 1,
  kDisconnected = 2,
  kTimeout = 3,
};

struct AttWaitResult {
  AttWaitOutcome outcome;
  BleConnectionEvent event;
  uint8_t errorCode;
};

bool centralReady(uint16_t connHandle) {
  return connHandle == 0U && manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

template <typename Attempt>
bool retryCentralProcedure(Attempt attempt, uint8_t maxAttempts = 10U,
                           unsigned long retryDelayMs = 300UL) {
  if (!manager().radio().isConnected() ||
      manager().radio().connectionRole() != BleConnectionRole::kCentral) {
    return false;
  }

  if (maxAttempts == 0U) {
    maxAttempts = 1U;
  }

  for (uint8_t attemptIndex = 0U; attemptIndex < maxAttempts; ++attemptIndex) {
    if (attempt()) {
      return true;
    }
    if (!manager().radio().isConnected() ||
        manager().radio().connectionRole() != BleConnectionRole::kCentral) {
      return false;
    }
    if ((attemptIndex + 1U) >= maxAttempts || retryDelayMs == 0UL) {
      continue;
    }

    const unsigned long delayStartMs = millis();
    while ((millis() - delayStartMs) < retryDelayMs) {
      if (!manager().radio().isConnected() ||
          manager().radio().connectionRole() != BleConnectionRole::kCentral) {
        return false;
      }
      yield();
    }
  }

  return false;
}

bool nextCentralEvent(BleConnectionEvent* event, uint32_t timeoutMs = 800UL) {
  if (event == nullptr) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (manager().radio().consumeDeferredConnectionEvent(event)) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }
    if (manager().radio().pollConnectionEvent(event, 120000UL)) {
      return true;
    }
  }
  return false;
}

template <typename QueueAttempt>
bool queueCentralAttProcedure(QueueAttempt queueAttempt, uint32_t timeoutMs = 1000UL) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (queueAttempt()) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }

    BleConnectionEvent event{};
    if (!nextCentralEvent(&event, 24UL)) {
      yield();
      continue;
    }

    if (event.terminateInd) {
      return false;
    }
    manager().handleCentralConnectionEvent(event);
  }

  return false;
}

AttWaitResult waitForAttOpcode(uint8_t requestOpcode, uint8_t responseOpcode,
                               uint32_t timeoutMs = 1000UL) {
  AttWaitResult result{};
  result.outcome = AttWaitOutcome::kTimeout;
  result.errorCode = 0U;

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    BleConnectionEvent event{};
    if (!nextCentralEvent(&event, 120UL)) {
      if (!manager().radio().isConnected()) {
        result.outcome = AttWaitOutcome::kDisconnected;
        return result;
      }
      continue;
    }

    if (event.terminateInd) {
      result.outcome = AttWaitOutcome::kDisconnected;
      result.event = event;
      return result;
    }

    if (!(event.packetReceived && event.crcOk && event.attPacket &&
          event.payload != nullptr && event.payloadLength >= 5U)) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode == kAttOpHandleValueNtf) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    if (attOpcode == kAttOpErrorRsp && event.payloadLength >= 9U) {
      if (event.payload[5] == requestOpcode) {
        result.outcome = AttWaitOutcome::kError;
        result.event = event;
        result.errorCode = event.payload[8];
        return result;
      }
      manager().handleCentralConnectionEvent(event);
      continue;
    }

