lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
uint16_t BLECharacteristic::writeFloat(float num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::read(void* buffer, uint16_t bufsize, uint16_t offset) {
  if (buffer == nullptr || bufsize == 0U) {
    return 0U;
  }
  if (_handles.value_handle != 0U) {
    uint8_t len = sizeof(_value);
    if (manager().radio().getCustomGattCharacteristicValue(_handles.value_handle, _value, &len)) {
      _value_len = len;
    }
  }
  if (offset >= _value_len) {
    return 0U;
  }
  const uint16_t toCopy = min<uint16_t>(bufsize, static_cast<uint16_t>(_value_len - offset));
  memcpy(buffer, &_value[offset], toCopy);
  return toCopy;
}

uint8_t BLECharacteristic::read8() {
  uint8_t value = 0U;
  read(&value, sizeof(value));
  return value;
}

uint16_t BLECharacteristic::read16() {
  uint16_t value = 0U;
  read(&value, sizeof(value));
  return value;
}

uint32_t BLECharacteristic::read32() {
  uint32_t value = 0UL;
  read(&value, sizeof(value));
  return value;
}

float BLECharacteristic::readFloat() {
  float value = 0.0f;
  read(&value, sizeof(value));
  return value;
}

uint16_t BLECharacteristic::getCccd(uint16_t conn_hdl) {
  (void)conn_hdl;
  uint16_t value = 0U;
  if (notifyEnabled()) {
    value |= 0x0001U;
  }
  if (indicateEnabled()) {
    value |= 0x0002U;
  }
  return value;
}

bool BLECharacteristic::notifyEnabled() { return notifyEnabled(0U); }

bool BLECharacteristic::notifyEnabled(uint16_t conn_hdl) {
  (void)conn_hdl;
  return (_handles.value_handle != 0U) &&
         manager().radio().isCustomGattCccdEnabled(_handles.value_handle, false);
}

bool BLECharacteristic::notify(const void* data, uint16_t len) {
  return notify(0U, data, len);
}

bool BLECharacteristic::notify(const char* str) {
  return notify(0U, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::notify8(uint8_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify16(uint16_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(uint32_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(int num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(float num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify(uint16_t conn_hdl, const void* data, uint16_t len) {
  (void)conn_hdl;
  if (_handles.value_handle == 0U) {
    return false;
  }
  const uint16_t written = write(data, len);
  if (len > 0U && written == 0U) {
    return false;
  }
  return manager().radio().notifyCustomGattCharacteristic(_handles.value_handle, false);
}

bool BLECharacteristic::notify(uint16_t conn_hdl, const char* str) {
  return notify(conn_hdl, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::notify8(uint16_t conn_hdl, uint8_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify16(uint16_t conn_hdl, uint16_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify32(uint16_t conn_hdl, uint32_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify32(uint16_t conn_hdl, int num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify32(uint16_t conn_hdl, float num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicateEnabled() { return indicateEnabled(0U); }

bool BLECharacteristic::indicateEnabled(uint16_t conn_hdl) {
  (void)conn_hdl;
  return (_handles.value_handle != 0U) &&
         manager().radio().isCustomGattCccdEnabled(_handles.value_handle, true);
}

bool BLECharacteristic::indicate(const void* data, uint16_t len) {
  return indicate(0U, data, len);
}

bool BLECharacteristic::indicate(const char* str) {
  return indicate(0U, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::indicate8(uint8_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate16(uint16_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(uint32_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(int num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(float num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate(uint16_t conn_hdl, const void* data, uint16_t len) {
  (void)conn_hdl;
  if (_handles.value_handle == 0U ||
      manager().radio().isCustomGattNotificationQueued(_handles.value_handle, true)) {
    return false;
  }
  const uint16_t written = write(data, len);
  if (len > 0U && written == 0U) {
    return false;
  }
  return manager().radio().notifyCustomGattCharacteristic(_handles.value_handle, true);
}

bool BLECharacteristic::indicate(uint16_t conn_hdl, const char* str) {
  return indicate(conn_hdl, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::indicate8(uint16_t conn_hdl, uint8_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate16(uint16_t conn_hdl, uint16_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, uint32_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, int num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, float num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

void BLECharacteristic::handleWriteFromRadio(const uint8_t* data, uint16_t len) {
  const uint8_t toCopy = clampValueLen(len);
  memset(_value, 0, sizeof(_value));
  if (data != nullptr && toCopy > 0U) {
    memcpy(_value, data, toCopy);
  }
  _value_len = toCopy;
  if (_userbuf != nullptr && _userbufsize > 0U) {
    const uint16_t copied = min<uint16_t>(_userbufsize, _value_len);
    memcpy(_userbuf, _value, copied);
  }
  if (_wr_cb != nullptr) {
    invokeBluefruitUserCallback(_wr_cb, 0U, this, _value, _value_len);
  }
}

void BLECharacteristic::pollCccdState() {
  if (_handles.value_handle == 0U || _cccd_wr_cb == nullptr) {
    return;
  }
  const bool notify = manager().radio().isCustomGattCccdEnabled(_handles.value_handle, false);
  const bool indicate = manager().radio().isCustomGattCccdEnabled(_handles.value_handle, true);
  if (notify == _notify_enabled && indicate == _indicate_enabled) {
    return;
  }
  _notify_enabled = notify;
  _indicate_enabled = indicate;
  uint16_t cccd = 0U;
  if (notify) {
    cccd |= 0x0001U;
  }
  if (indicate) {
    cccd |= 0x0002U;
  }
  invokeBluefruitUserCallback(_cccd_wr_cb, 0U, this, cccd);
}

