lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEPeriph::clearBonds() {
  (void)manager().radio().clearBondRecord();
}

BLEConnection::BLEConnection() : handle_(INVALID_CONNECTION_HANDLE) {}

uint16_t BLEConnection::handle() const { return handle_; }

bool BLEConnection::connected() const { return Bluefruit.connected(handle_); }

bool BLEConnection::bonded() const { return connected() && manager().radio().hasBondRecord(); }

bool BLEConnection::secured() const {
  return connected() && manager().radio().isConnectionEncrypted();
}

bool BLEConnection::getPeerName(char* name, uint16_t bufsize) const {
  if (name == nullptr || bufsize == 0U || !manager().radio().isConnected()) {
    return false;
  }
  BleConnectionInfo info{};
  if (!manager().radio().getConnectionInfo(&info)) {
    return false;
  }
  snprintf(name, bufsize, "%02X:%02X:%02X:%02X:%02X:%02X", info.peerAddress[5],
           info.peerAddress[4], info.peerAddress[3], info.peerAddress[2], info.peerAddress[1],
           info.peerAddress[0]);
  return true;
}

bool BLEConnection::disconnect() const { return Bluefruit.disconnect(handle_); }

bool BLEConnection::requestPHY(uint8_t phy) {
  if (!connected()) {
    return false;
  }
  const uint8_t normalized = normalizeBluefruitPhy(phy);
  if (normalized == BLE_GAP_PHY_AUTO) {
    return false;
  }
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionPhyRequest(normalized);
  }
  return manager().radio().requestPHY(normalized);
}

uint8_t BLEConnection::getPHY() const {
  return connected() ? manager().radio().getPHY() : BLE_GAP_PHY_AUTO;
}

uint16_t BLEConnection::getConnectionInterval() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.intervalUnits : 0U;
}

uint16_t BLEConnection::getSlaveLatency() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.latency : 0U;
}

uint16_t BLEConnection::getSupervisionTimeout() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.supervisionTimeoutUnits : 0U;
}

uint16_t BLEConnection::getDataLength() const {
  return connected() ? manager().radio().currentDataLength() : 0U;
}

bool BLEConnection::requestDataLengthUpdate() {
  if (!connected()) {
    return false;
  }
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionDataLengthUpdate();
  }
  return manager().radio().requestDataLengthUpdate();
}

bool BLEConnection::requestMtuExchange(uint16_t mtu) {
  if (!connected()) {
    return false;
  }
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionMtuExchange(mtu);
  }
  return manager().radio().requestAttMtuExchange(mtu);
}

uint16_t BLEConnection::getMtu() const {
  if (!connected()) {
    return 23U;
  }
  return manager().radio().currentAttMtu();
}

bool BLEConnection::requestPairing() const {
  if (!connected()) {
    return false;
  }
  if (manager().radio().connectionRole() == BleConnectionRole::kPeripheral) {
    return manager().radio().sendSmpSecurityRequest();
  }
  return false;
}

bool BLEConnection::monitorRssi(uint8_t threshold) const {
  if (!connected()) {
    return false;
  }
  return manager().startRssiMonitor(threshold);
}

int8_t BLEConnection::getRssi() const {
  if (!connected()) {
    return 0;
  }
  return manager().currentConnectionRssi();
}

BLECentral::BLECentral() : connect_callback_(nullptr), disconnect_callback_(nullptr) {}

void BLECentral::setConnectCallback(ble_connect_callback_t fp) { connect_callback_ = fp; }

void BLECentral::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLECentral::connect(const ble_gap_evt_adv_report_t* report) {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  return manager().queueCentralConnect(report);
}

bool BLECentral::connected() const {
  serviceBluefruitBeforePollingState();
  return manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

void BLECentral::clearBonds() {
  (void)manager().radio().clearBondRecord();
}

BLEScanner::BLEScanner()
    : rx_callback_(nullptr),
      interval_(160U),
      window_(80U),
      timeout_s_(0U),
      active_scan_(false),
      restart_on_disconnect_(false),
      running_(false),
      paused_(false),
      has_filter_uuid_(false),
      filter_uuid_(),
      has_filter_msd_(false),
      filter_msd_company_(0U),
      has_filter_rssi_(false),
      filter_rssi_dbm_(-127) {}

void BLEScanner::setRxCallback(rx_callback_t fp) { rx_callback_ = fp; }

void BLEScanner::setInterval(uint16_t interval, uint16_t window) {
  interval_ = interval;
  window_ = (window == 0U) ? interval : window;
}

void BLEScanner::setIntervalMS(uint16_t interval_ms, uint16_t window_ms) {
  setInterval(MS1000TO625(interval_ms),
              (window_ms == 0U) ? 0U : MS1000TO625(window_ms));
}

void BLEScanner::useActiveScan(bool enabled) { active_scan_ = enabled; }

void BLEScanner::restartOnDisconnect(bool enabled) { restart_on_disconnect_ = enabled; }

void BLEScanner::filterUuid(const BLEUuid& uuid) {
  filter_uuid_ = uuid;
  has_filter_uuid_ = uuid.begin();
}

void BLEScanner::filterService(const BLEUuid& uuid) { filterUuid(uuid); }

void BLEScanner::filterService(const BLEClientService& service) { filterUuid(service.uuid); }

void BLEScanner::filterMSD(uint16_t company_id) {
  filter_msd_company_ = company_id;
  has_filter_msd_ = true;
}

void BLEScanner::filterRssi(int8_t min_rssi_dbm) {
  filter_rssi_dbm_ = min_rssi_dbm;
  has_filter_rssi_ = true;
}

void BLEScanner::start(uint16_t timeout) {
  if (!manager().begin(0U, 1U)) {
    return;
  }
  timeout_s_ = timeout;
  running_ = true;
  paused_ = false;
}

bool BLEScanner::stop() {
  return manager().stopScanner();
}

void BLEScanner::resume() { paused_ = false; }

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const BLEUuid& uuid) const {
  return report != nullptr && adDataHasUuid(report->data.p_data, report->data.len, uuid);
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const uint8_t uuid128[16]) const {
  return (uuid128 != nullptr) && checkReportForUuid(report, BLEUuid(uuid128));
}

