lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEUuid& uuid) const {
  return checkReportForUuid(report, uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientService& service) const {
  return checkReportForService(report, service.uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientUart& client_uart) const {
  return checkReportForService(report, client_uart.serviceUuid());
}

int BLEScanner::parseReportByType(const ble_gap_evt_adv_report_t* report, uint8_t type,
                                  void* buffer, uint8_t buffer_len) const {
  if (report == nullptr) {
    return 0;
  }
  return copyAdFieldByType(report->data.p_data, report->data.len, type, buffer, buffer_len);
}

BLEClientCharacteristic::BLEClientCharacteristic()
    : uuid(),
      begun_(false),
      discovered_(false),
      notify_callback_(nullptr),
      service_(nullptr),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      decl_handle_(0U),
      value_handle_(0U),
      end_handle_(0U),
      cccd_handle_(0U),
      last_value_{0},
      last_value_len_(0U),
      pending_notify_callback_(false) {}

BLEClientCharacteristic::BLEClientCharacteristic(BLEUuid bleuuid)
    : BLEClientCharacteristic() {
  uuid = bleuuid;
}

bool BLEClientCharacteristic::begin() {
  return begin(nullptr);
}

bool BLEClientCharacteristic::begin(BLEClientService* parent_service) {
  if (begun_) {
    return true;
  }
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  service_ = (parent_service != nullptr) ? parent_service : BLEClientService::lastService;
  if (service_ == nullptr || !manager().registerClientCharacteristic(this)) {
    return false;
  }
  begun_ = true;
  return true;
}

BLEClientService& BLEClientCharacteristic::parentService() { return *service_; }

const BLEClientService& BLEClientCharacteristic::parentService() const { return *service_; }

void BLEClientCharacteristic::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  decl_handle_ = 0U;
  value_handle_ = 0U;
  end_handle_ = 0U;
  cccd_handle_ = 0U;
  last_value_len_ = 0U;
}

bool BLEClientCharacteristic::discover(uint16_t conn_hdl) {
  if (!begin() || service_ == nullptr || !service_->discover(conn_hdl)) {
    resetDiscovery();
    return false;
  }
  return discover();
}

bool BLEClientCharacteristic::discover() {
  if (!begin() || service_ == nullptr || !service_->discovered_) {
    resetDiscovery();
    return false;
  }

  resetDiscovery();
  if (!retryCentralProcedure([&]() {
        return discoverCharacteristicSync(service_->start_handle_, service_->end_handle_,
                                          uuid, &decl_handle_, &value_handle_,
                                          &end_handle_);
      })) {
    return false;
  }
  conn_handle_ = service_->conn_handle_;
  discovered_ = true;
  return true;
}

uint16_t BLEClientCharacteristic::read(void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  uint8_t scratch[sizeof(last_value_)] = {0};
  const uint16_t readLen = readHandleSync(value_handle_, scratch, sizeof(scratch));
  if (readLen == 0U) {
    return 0U;
  }
  last_value_len_ =
      static_cast<uint8_t>(min<uint16_t>(readLen, sizeof(last_value_)));
  memcpy(last_value_, scratch, last_value_len_);
  const uint16_t copyLen = min<uint16_t>(len, readLen);
  memcpy(buffer, scratch, copyLen);
  return copyLen;
}

uint8_t BLEClientCharacteristic::read8() {
  uint8_t value = 0U;
  (void)read(&value, sizeof(value));
  return value;
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U ||
      len > BleRadio::kCustomGattMaxValueLength) {
    return 0U;
  }
  if (!waitForLinkValueCapacity(len)) {
    return 0U;
  }
  return writeHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len, true) ? len
                                                                                          : 0U;
}

uint16_t BLEClientCharacteristic::write8(uint8_t value) {
  return write(&value, sizeof(value));
}

bool BLEClientCharacteristic::enableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x01U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

bool BLEClientCharacteristic::disableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x00U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

void BLEClientCharacteristic::handleNotify(const uint8_t* data, uint16_t len) {
  const uint8_t copyLen = min<uint16_t>(len, sizeof(last_value_));
  if (copyLen > 0U && data != nullptr) {
    memcpy(last_value_, data, copyLen);
  }
  last_value_len_ = copyLen;
  if (notify_callback_ != nullptr) {
    pending_notify_callback_ = true;
  }
}

void BLEClientCharacteristic::dispatchPendingNotify() {
  if (!pending_notify_callback_ || notify_callback_ == nullptr) {
    return;
  }
  pending_notify_callback_ = false;
  invokeBluefruitUserCallback(notify_callback_, this, last_value_, last_value_len_);
}

BLEClientService::BLEClientService()
    : uuid(),
      begun_(false),
      discovered_(false),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      start_handle_(0U),
      end_handle_(0U) {}

