lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BLEClientService::BLEClientService(BLEUuid bleuuid)
    : BLEClientService() {
  uuid = bleuuid;
}

bool BLEClientService::begin() {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  begun_ = true;
  lastService = this;
  return true;
}

void BLEClientService::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  start_handle_ = 0U;
  end_handle_ = 0U;
}

bool BLEClientService::discover(uint16_t conn_hdl) {
  resetDiscovery();
  if ((!begun_ && !begin()) || !centralReady(conn_hdl)) {
    return false;
  }
  // Drain any queued link-setup TX (DLE, MTU, PHY) before attempting
  // ATT service discovery, otherwise the ATT request backs up behind it.
  manager().radio().forceClearPendingTx();
  if (!retryCentralProcedure([&]() {
        return discoverServiceRangeSync(uuid, &start_handle_, &end_handle_);
      })) {
    return false;
  }
  conn_handle_ = conn_hdl;
  discovered_ = true;
  lastService = this;
  return true;
}

BLEClientUart* BLEClientUart::instances_[BLEClientUart::kMaxInstances] = {};
uint8_t BLEClientUart::instance_count_ = 0U;

BLEClientUart::BLEClientUart()
    : service_(BLEUART_UUID_SERVICE),
      txd_(BLEUART_UUID_CHR_TXD),
      rxd_(BLEUART_UUID_CHR_RXD),
      discovered_(false),
      rx_callback_(nullptr),
      rx_fifo_{0},
      rx_head_(0U),
      rx_tail_(0U),
      rx_count_(0U) {
  if (instance_count_ < kMaxInstances) {
    instances_[instance_count_++] = this;
  }
}

bool BLEClientUart::begin() {
  txd_.setNotifyCallback(txdNotifyThunk);
  return service_.begin() && txd_.begin(&service_) && rxd_.begin(&service_);
}

bool BLEClientUart::discover(uint16_t conn_hdl) {
  discovered_ = false;
  rx_head_ = 0U;
  rx_tail_ = 0U;
  rx_count_ = 0U;
  if (!begin() || !service_.discover(conn_hdl) || !txd_.discover() || !rxd_.discover()) {
    return false;
  }
  discovered_ = true;
  return true;
}

bool BLEClientUart::enableTXD() { return discovered_ && txd_.enableNotify(); }

int BLEClientUart::read() {
  if (rx_count_ == 0U) {
    return -1;
  }
  const int value = rx_fifo_[rx_tail_];
  rx_tail_ = static_cast<uint16_t>((rx_tail_ + 1U) % kRxFifoDepth);
  --rx_count_;
  return value;
}

int BLEClientUart::read(uint8_t* buffer, size_t size) {
  if (buffer == nullptr || size == 0U) {
    return 0;
  }

  size_t copied = 0U;
  while (copied < size) {
    const int value = read();
    if (value < 0) {
      break;
    }
    buffer[copied++] = static_cast<uint8_t>(value);
  }
  return static_cast<int>(copied);
}

int BLEClientUart::available() { return rx_count_; }

int BLEClientUart::peek() {
  if (rx_count_ == 0U) {
    return -1;
  }
  return rx_fifo_[rx_tail_];
}

void BLEClientUart::flush() {}

size_t BLEClientUart::write(uint8_t value) { return write(&value, 1U); }

size_t BLEClientUart::write(const uint8_t* buffer, size_t size) {
  if (!discovered_ || buffer == nullptr || size == 0U || !centralReady(0U) ||
      rxd_.value_handle_ == 0U) {
    return 0U;
  }

  size_t sent = 0U;
  while (sent < size) {
    const uint8_t chunk = min<uint16_t>(BleRadio::kCustomGattMaxValueLength,
                                        static_cast<uint16_t>(size - sent));
    if (!writeHandleSync(rxd_.value_handle_, &buffer[sent], chunk, true)) {
      break;
    }
    sent += chunk;
  }
  return sent;
}

const BLEUuid& BLEClientUart::serviceUuid() const { return service_.uuid; }

void BLEClientUart::handleTxdNotify(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  (void)chr;
  for (uint16_t i = 0U; i < len; ++i) {
    if (rx_count_ >= kRxFifoDepth) {
      break;
    }
    rx_fifo_[rx_head_] = data[i];
    rx_head_ = static_cast<uint16_t>((rx_head_ + 1U) % kRxFifoDepth);
    ++rx_count_;
  }
  if (rx_callback_ != nullptr) {
    invokeBluefruitUserCallback(rx_callback_, *this);
  }
}

void BLEClientUart::txdNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  for (uint8_t i = 0U; i < instance_count_; ++i) {
    BLEClientUart* instance = instances_[i];
    if (instance != nullptr && (&instance->txd_ == chr)) {
      instance->handleTxdNotify(chr, data, len);
      return;
    }
  }
}

BLEClientDis::BLEClientDis()
    : BLEClientService(UUID16_SVC_DEVICE_INFORMATION),
      manufacturer_(UUID16_CHR_MANUFACTURER_NAME_STRING),
      model_(UUID16_CHR_MODEL_NUMBER_STRING) {}

bool BLEClientDis::begin() {
  return BLEClientService::begin() && manufacturer_.begin() && model_.begin();
}

bool BLEClientDis::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)manufacturer_.discover();
  (void)model_.discover();
  return true;
}

bool BLEClientDis::getManufacturer(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      manufacturer_.discovered() ? manufacturer_.read(buffer, static_cast<uint16_t>(len - 1U))
                                 : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

bool BLEClientDis::getModel(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      model_.discovered() ? model_.read(buffer, static_cast<uint16_t>(len - 1U)) : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

BLEClientBas::BLEClientBas()
    : BLEClientService(UUID16_SVC_BATTERY), battery_(UUID16_CHR_BATTERY_LEVEL) {}

bool BLEClientBas::begin() {
  return BLEClientService::begin() && battery_.begin();
}

bool BLEClientBas::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)battery_.discover();
  return true;
}

uint8_t BLEClientBas::read() {
  return battery_.discovered() ? battery_.read8() : 0U;
}

BLEClientCts::BLEClientCts()
    : BLEClientService(UUID16_SVC_CURRENT_TIME),
      current_time_(UUID16_CHR_CURRENT_TIME),
      local_info_(UUID16_CHR_LOCAL_TIME_INFORMATION),
      adjust_callback_(nullptr),
      Time{},
      LocalInfo{} {}

bool BLEClientCts::begin() {
  current_time_.setNotifyCallback(currentTimeNotifyThunk);
  return BLEClientService::begin() && current_time_.begin(this) && local_info_.begin(this);
}

