lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, hid_keyboard_report_t* report) {
  (void)conn_hdl;
  return report != nullptr && Bluefruit.connected();
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, uint8_t modifier, uint8_t keycode[6]) {
  hid_keyboard_report_t report{};
  report.modifier = modifier;
  if (keycode != nullptr) {
    memcpy(report.keycode, keycode, sizeof(report.keycode));
  }
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyPress(uint16_t conn_hdl, char ch) {
  const uint8_t ascii = static_cast<uint8_t>(ch);
  if (ascii >= 128U) {
    return false;
  }
  hid_keyboard_report_t report{};
  report.modifier = hid_ascii_to_keycode[ascii][0] ? KEYBOARD_MODIFIER_LEFTSHIFT : 0U;
  report.keycode[0] = hid_ascii_to_keycode[ascii][1];
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyRelease(uint16_t conn_hdl) {
  hid_keyboard_report_t report{};
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keySequence(uint16_t conn_hdl, const char* str, int interval) {
  if (str == nullptr) {
    return false;
  }
  for (const char* cursor = str; *cursor != '\0'; ++cursor) {
    if (!keyPress(conn_hdl, *cursor)) {
      return false;
    }
    delay(interval);
    if (!keyRelease(conn_hdl)) {
      return false;
    }
    delay(interval);
  }
  return true;
}

bool BLEHidAdafruit::consumerReport(uint16_t usage_code) {
  return consumerReport(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t usage_code) {
  return consumerKeyPress(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(void) {
  return consumerKeyRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::consumerReport(uint16_t conn_hdl, uint16_t usage_code) {
  (void)conn_hdl;
  (void)usage_code;
  return Bluefruit.connected();
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t conn_hdl, uint16_t usage_code) {
  return consumerReport(conn_hdl, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(uint16_t conn_hdl) {
  return consumerReport(conn_hdl, 0U);
}

bool BLEHidAdafruit::mouseReport(hid_mouse_report_t* report) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidAdafruit::mouseReport(uint8_t buttons, int8_t x, int8_t y, int8_t wheel, int8_t pan) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, buttons, x, y, wheel, pan);
}

bool BLEHidAdafruit::mouseButtonPress(uint8_t buttons) {
  return mouseButtonPress(BLE_CONN_HANDLE_INVALID, buttons);
}

bool BLEHidAdafruit::mouseButtonRelease(void) {
  return mouseButtonRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::mouseMove(int8_t x, int8_t y) {
  return mouseMove(BLE_CONN_HANDLE_INVALID, x, y);
}

bool BLEHidAdafruit::mouseScroll(int8_t scroll) {
  return mouseScroll(BLE_CONN_HANDLE_INVALID, scroll);
}

bool BLEHidAdafruit::mousePan(int8_t pan) { return mousePan(BLE_CONN_HANDLE_INVALID, pan); }

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, hid_mouse_report_t* report) {
  (void)conn_hdl;
  return report != nullptr && Bluefruit.connected();
}

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, uint8_t buttons, int8_t x, int8_t y,
                                 int8_t wheel, int8_t pan) {
  hid_mouse_report_t report{buttons, x, y, wheel, pan};
  return mouseReport(conn_hdl, &report);
}

bool BLEHidAdafruit::mouseButtonPress(uint16_t conn_hdl, uint8_t buttons) {
  mouse_buttons_ |= buttons;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseButtonRelease(uint16_t conn_hdl) {
  mouse_buttons_ = 0U;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseMove(uint16_t conn_hdl, int8_t x, int8_t y) {
  return mouseReport(conn_hdl, mouse_buttons_, x, y, 0, 0);
}

bool BLEHidAdafruit::mouseScroll(uint16_t conn_hdl, int8_t scroll) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, scroll, 0);
}

bool BLEHidAdafruit::mousePan(uint16_t conn_hdl, int8_t pan) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, pan);
}

BLEHidGamepad::BLEHidGamepad() : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE) {}

err_t BLEHidGamepad::begin() { return BLEService::begin(); }

bool BLEHidGamepad::report(hid_gamepad_report_t* report) {
  return this->report(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidGamepad::report(uint16_t conn_hdl, hid_gamepad_report_t* report) {
  (void)conn_hdl;
  return report != nullptr && Bluefruit.connected();
}

BLEDis::BLEDis()
    : BLEService(UUID16_SVC_DEVICE_INFORMATION), values_{nullptr}, lengths_{0}, auto_serial_{0} {}

void BLEDis::setSystemID(const char* system_id, uint8_t length) {
  values_[0] = system_id;
  lengths_[0] = length;
}

void BLEDis::setModel(const char* model, uint8_t length) {
  values_[1] = model;
  lengths_[1] = length;
}

void BLEDis::setSerialNum(const char* serial_num, uint8_t length) {
  values_[2] = serial_num;
  lengths_[2] = length;
}

void BLEDis::setFirmwareRev(const char* firmware_rev, uint8_t length) {
  values_[3] = firmware_rev;
  lengths_[3] = length;
}

void BLEDis::setHardwareRev(const char* hw_rev, uint8_t length) {
  values_[4] = hw_rev;
  lengths_[4] = length;
}

void BLEDis::setSoftwareRev(const char* sw_rev, uint8_t length) {
  values_[5] = sw_rev;
  lengths_[5] = length;
}

void BLEDis::setManufacturer(const char* manufacturer, uint8_t length) {
  values_[6] = manufacturer;
  lengths_[6] = length;
}

void BLEDis::setRegCertList(const char* reg_cert_list, uint8_t length) {
  values_[7] = reg_cert_list;
  lengths_[7] = length;
}

void BLEDis::setPNPID(const char* pnp_id, uint8_t length) {
  values_[8] = pnp_id;
  lengths_[8] = length;
}

err_t BLEDis::begin() {
  static const uint16_t kCharacteristicUuids[9] = {
      UUID16_CHR_SYSTEM_ID,        UUID16_CHR_MODEL_NUMBER_STRING,
      UUID16_CHR_SERIAL_NUMBER_STRING, UUID16_CHR_FIRMWARE_REVISION_STRING,
      UUID16_CHR_HARDWARE_REVISION_STRING, UUID16_CHR_SOFTWARE_REVISION_STRING,
      UUID16_CHR_MANUFACTURER_NAME_STRING, UUID16_CHR_REGULATORY_CERT_DATA_LIST,
      UUID16_CHR_PNP_ID};
  static constexpr char kDefaultManufacturer[] = "Seeed Studio";
  static constexpr char kDefaultModel[] = "XIAO nRF54L15";
  static constexpr char kDefaultHardwareRev[] = "XIAO nRF54L15";

  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  if (values_[1] == nullptr || lengths_[1] == 0U) {
    setModel(kDefaultModel);
  }
  if (values_[2] == nullptr || lengths_[2] == 0U) {
    snprintf(auto_serial_, sizeof(auto_serial_), "%08" PRIX32 "%08" PRIX32,
             NRF_FICR->INFO.DEVICEID[1], NRF_FICR->INFO.DEVICEID[0]);
    setSerialNum(auto_serial_);
  }
  if (values_[3] == nullptr || lengths_[3] == 0U) {
    setFirmwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[4] == nullptr || lengths_[4] == 0U) {
    setHardwareRev(kDefaultHardwareRev);
  }
  if (values_[5] == nullptr || lengths_[5] == 0U) {
    setSoftwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[6] == nullptr || lengths_[6] == 0U) {
    setManufacturer(kDefaultManufacturer);
  }

  for (uint8_t i = 0U; i < 9U; ++i) {
    if (values_[i] == nullptr || lengths_[i] == 0U) {
      continue;
    }
    const uint8_t len = clampValueLen(lengths_[i]);
    if (!manager().radio().addCustomGattCharacteristic(
            _handle, kCharacteristicUuids[i], xiao_nrf54l15::kBleGattPropRead,
            reinterpret_cast<const uint8_t*>(values_[i]), len, nullptr, nullptr)) {
      return ERROR_INVALID_STATE;
    }
  }
  return ERROR_NONE;
}

